Yes, I see below plan
```
  # google_compute_global_address.proj-prod-sip-cla2-lb-b0e8-com must be replaced
-/+ resource "google_compute_global_address" "proj-prod-sip-cla2-lb-b0e8-com" {
      ~ address            = "34.107.171.13" -> (known after apply)
      - address_type       = "EXTERNAL" -> null
      ~ creation_timestamp = "2020-04-16T15:06:47.251-07:00" -> (known after apply)
      ~ description        = "a.b0e8.com ---updated" -> "a.b0e8.com--updated2d" # forces replacement
      ~ id                 = "projects/myproject/global/addresses/sip-cla2-lb-b0e8-com" -> (known after apply)
        name               = "sip-cla2-lb-b0e8-com"
      - prefix_length      = 0 -> null
      ~ project            = "myproject" -> (known after apply)
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/myproject/global/addresses/sip-cla2-lb-b0e8-com" -> (known after apply)
    }
```